feat(prod docker): added docker compose prod
